node {
  name: "global_step/initial_value"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/initial_value"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "mul/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1024
      }
    }
  }
}
node {
  name: "mul"
  op: "Mul"
  input: "global_step/read"
  input: "mul/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "mul_1/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "mul_1"
  op: "Mul"
  input: "mul"
  input: "mul_1/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ExponentialDecay/learning_rate"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.009999999776482582
      }
    }
  }
}
node {
  name: "ExponentialDecay/Cast"
  op: "Cast"
  input: "mul_1"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ExponentialDecay/Cast_1/x"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 4000000
      }
    }
  }
}
node {
  name: "ExponentialDecay/Cast_1"
  op: "Cast"
  input: "ExponentialDecay/Cast_1/x"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ExponentialDecay/Cast_2/x"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.949999988079071
      }
    }
  }
}
node {
  name: "ExponentialDecay/truediv"
  op: "RealDiv"
  input: "ExponentialDecay/Cast"
  input: "ExponentialDecay/Cast_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ExponentialDecay/Floor"
  op: "Floor"
  input: "ExponentialDecay/truediv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ExponentialDecay/Pow"
  op: "Pow"
  input: "ExponentialDecay/Cast_2/x"
  input: "ExponentialDecay/Floor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ExponentialDecay"
  op: "Mul"
  input: "ExponentialDecay/learning_rate"
  input: "ExponentialDecay/Pow"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "learning_rate/tags"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "learning_rate"
      }
    }
  }
}
node {
  name: "learning_rate"
  op: "ScalarSummary"
  input: "learning_rate/tags"
  input: "ExponentialDecay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "train_input/input_producer/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 366
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 366
          }
        }
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train-f.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train-I.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train-P.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train-y.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train0-.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train06.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train0W.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train0Z.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train0_.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train10.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train1B.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train1C.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train1W.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train2C.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train2J.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train2w.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train2Z.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train36.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train37.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train3c.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train3f.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train3O.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train3q.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train3T.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train4-.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train41.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train45.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train4f.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train4K.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train4Q.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train4V.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train4y.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train5-.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train5A.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train5c.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train5D.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train5h.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train5r.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train5s.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train5z.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train61.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train64.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train6A.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train6E.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train6f.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train6g.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train6l.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train6m.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train6Q.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train73.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train78.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train7a.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train7p.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train7S.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train7W.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train7_.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train8B.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train8c.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train8D.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train8p.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train8T.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train8v.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train8X.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train95.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train9c.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train9e.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train9H.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train9K.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train9T.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train9Y.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traina-.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainA4.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traina7.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainad.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainAE.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainAI.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainAk.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainam.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainAs.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainaT.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainaU.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainaX.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainB3.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainB7.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainBb.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainbF.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainBi.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainBJ.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainbK.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainBn.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainbu.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainbw.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainbX.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainc4.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainC6.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainCa.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainCe.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainCF.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainCj.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traincK.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainCN.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainCp.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainCQ.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainCR.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traincs.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainCt.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainD8.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainda.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traindB.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainDC.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainDf.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainDG.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainDh.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainDk.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traindL.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainDP.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainDv.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traindw.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainE0.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traine4.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traine5.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainEa.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainEb.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traineC.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainED.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainEe.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainEj.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traineM.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traineo.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traineq.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traines.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traineT.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainez.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainf-.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainf2.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainf4.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainf6.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainfB.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainFd.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainfE.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainfG.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainFk.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainFm.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainfo.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainfQ.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainfU.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traing0.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traing3.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainGH.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traingJ.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainGO.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traingp.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traingR.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainGU.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainGz.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainG_.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainh3.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainHA.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainhE.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainhl.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainHo.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainhR.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainhS.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainhX.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainI0.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainI1.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainIc.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainIE.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainIF.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainih.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainii.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainIj.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainIl.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainIn.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainIP.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainIR.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainIU.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainiw.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainIX.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainIY.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainiZ.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainj2.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainJ5.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainj6.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainJC.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainjd.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainjF.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainjI.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainjR.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainJT.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainjU.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainjW.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainjx.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainK-.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainK5.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainK9.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainKF.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainkJ.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainkK.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainkN.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainko.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainkr.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainKU.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainkV.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainkW.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainky.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainKZ.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainL9.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainLb.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainLc.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainLE.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainLg.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainLH.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainlN.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainLx.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainl_.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainmc.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainMe.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainmH.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainMT.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainMW.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainNb.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainnE.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainnF.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainnk.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainnL.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainNp.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainnu.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainnW.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainNy.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainn_.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainO3.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traino5.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traino8.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainO9.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainOA.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainoB.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainoD.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainOo.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainOp.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainor.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainOS.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainOV.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainp8.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainPf.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainpm.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainPp.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainPU.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainpX.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainPZ.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainQ5.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainqC.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainqd.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainqe.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainqJ.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainQk.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainqL.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainqM.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainQN.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainQX.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainr4.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainRc.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainrD.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainrG.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainrH.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainRN.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainrP.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainRQ.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainRS.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainru.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainRy.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trains4.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainS8.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainsb.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainSC.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainSh.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainsi.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainsO.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainsQ.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainSS.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainsw.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainT-.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traint1.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainT6.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainT7.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traint9.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traintA.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainTb.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainTe.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainti.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainTP.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainTT.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traintU.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\traintY.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainU8.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainUa.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainUC.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainuD.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainue.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainUJ.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainUK.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainul.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainus.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainut.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainux.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainUY.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainuZ.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainV5.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainV7.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainV8.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainvB.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainvc.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainVe.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainVK.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainvP.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainVQ.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainvx.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainVZ.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainw4.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainWD.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainwE.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainWK.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainWl.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainwM.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainwS.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainWv.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainwX.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainw_.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainX4.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainX5.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainX9.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainxG.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainxO.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainxq.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainxx.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainXy.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainXz.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainy-.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainY0.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainy3.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainY6.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainYA.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainYE.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainyh.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainyQ.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainYR.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainyu.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainyX.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainY_.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainZ6.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainZ8.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainzB.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainzc.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainzi.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainZm.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainzN.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainzs.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainzu.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainzv.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainzW.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainzX.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\trainz_.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train_B.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train_P.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train_S.tfrecord"
        string_val: "..\\..\\datasets\\youtube-8m\\video_level\\train_Z.tfrecord"
      }
    }
  }
}
node {
  name: "train_input/input_producer/Size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 366
      }
    }
  }
}
node {
  name: "train_input/input_producer/Greater/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "train_input/input_producer/Greater"
  op: "Greater"
  input: "train_input/input_producer/Size"
  input: "train_input/input_producer/Greater/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "train_input/input_producer/Assert/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "train_input/input_producer/Assert/Assert/data_0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "string_input_producer requires a non-null input tensor"
      }
    }
  }
}
node {
  name: "train_input/input_producer/Assert/Assert"
  op: "Assert"
  input: "train_input/input_producer/Greater"
  input: "train_input/input_producer/Assert/Assert/data_0"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "train_input/input_producer/Identity"
  op: "Identity"
  input: "train_input/input_producer/Const"
  input: "^train_input/input_producer/Assert/Assert"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 366
          }
        }
      }
    }
  }
}
node {
  name: "train_input/input_producer/RandomShuffle"
  op: "RandomShuffle"
  input: "train_input/input_producer/Identity"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 366
          }
        }
      }
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "train_input/input_producer/limit_epochs/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "train_input/input_producer/limit_epochs/epochs"
  op: "VariableV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_input/input_producer/limit_epochs/epochs/Assign"
  op: "Assign"
  input: "train_input/input_producer/limit_epochs/epochs"
  input: "train_input/input_producer/limit_epochs/Const"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_input/input_producer/limit_epochs/epochs"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train_input/input_producer/limit_epochs/epochs/read"
  op: "Identity"
  input: "train_input/input_producer/limit_epochs/epochs"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_input/input_producer/limit_epochs/epochs"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "train_input/input_producer/limit_epochs/CountUpTo"
  op: "CountUpTo"
  input: "train_input/input_producer/limit_epochs/epochs"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train_input/input_producer/limit_epochs/epochs"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "limit"
    value {
      i: 5
    }
  }
}
node {
  name: "train_input/input_producer/limit_epochs"
  op: "Identity"
  input: "train_input/input_producer/RandomShuffle"
  input: "^train_input/input_producer/limit_epochs/CountUpTo"
  attr {
    key: "T"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 366
          }
        }
      }
    }
  }
}
node {
  name: "train_input/input_producer"
  op: "FIFOQueueV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "capacity"
    value {
      i: 32
    }
  }
  attr {
    key: "component_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_input/input_producer/input_producer_EnqueueMany"
  op: "QueueEnqueueManyV2"
  input: "train_input/input_producer"
  input: "train_input/input_producer/limit_epochs"
  attr {
    key: "Tcomponents"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "timeout_ms"
    value {
      i: -1
    }
  }
}
node {
  name: "train_input/input_producer/input_producer_Close"
  op: "QueueCloseV2"
  input: "train_input/input_producer"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: false
    }
  }
}
node {
  name: "train_input/input_producer/input_producer_Close_1"
  op: "QueueCloseV2"
  input: "train_input/input_producer"
  attr {
    key: "cancel_pending_enqueues"
    value {
      b: true
    }
  }
}
node {
  name: "train_input/input_producer/input_producer_Size"
  op: "QueueSizeV2"
  input: "train_input/input_producer"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "train_input/input_producer/Cast"
  op: "Cast"
  input: "train_input/input_producer/input_producer_Size"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "train_input/input_producer/mul/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.03125
      }
    }
  }
}
node {
  name: "train_input/input_producer/mul"
  op: "Mul"
  input: "train_input/input_producer/Cast"
  input: "train_input/input_producer/mul/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "train_input/input_producer/fraction_of_32_full/tags"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "train_input/input_producer/fraction_of_32_full"
      }
    }
  }
}
node {
  name: "train_input/input_producer/fraction_of_32_full"
  op: "ScalarSummary"
  input: "train_input/input_producer/fraction_of_32_full/tags"
  input: "train_input/input_producer/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "train_input/TFRecordReaderV2"
  op: "TFRecordReaderV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "compression_type"
    value {
      s: ""
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train_input/ReaderReadUpToV2/num_records"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 1024
      }
    }
  }
}
node {
  name: "train_input/ReaderReadUpToV2"
  op: "ReaderReadUpToV2"
  input: "train_input/TFRecordReaderV2"
  input: "train_input/input_producer"
  input: "train_input/ReaderReadUpToV2/num_records"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "train_input/ParseExample/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "train_input/ParseExample/Const_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "train_input/ParseExample/ParseExample/names"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "train_input/ParseExample/ParseExample/sparse_keys_0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "labels"
      }
    }
  }
}
node {
  name: "train_input/ParseExample/ParseExample/dense_keys_0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "mean_rgb"
      }
    }
  }
}
node {
  name: "train_input/ParseExample/ParseExample/dense_keys_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
